# RebarShapeAllowedBarTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarShapeAllowedBarTypes Property
ParameterTypeId Class See Also
---
"Allowable Rebar Bar Types"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarShapeAllowedBarTypes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeAllowedBarTypes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarShapeAllowedBarTypes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace